package _02grammar;

/**
 * @author: ChenXin
 * @createTime: 2022-09-04 11:38
 * @Description: Java标识符
 * @version: 1.0.0
 */


/**
 * 什么是标识符？
 * 在编译过程中，经常需要在程序中定义一些符号来标记名称，如包名、类名、方法名、参数名、变量名等，这些符号被称为标识符
 * <p>
 * 命名规则：它是有26个字母大小写，数字0-9，符号 _ 与 $ 组成
 * 规定：
 * 1.不能以数字开头
 * 2.不可以使用Java关键字、保留字
 * <p>
 * 为了增强代码的可读性，还应该遵循以下规则
 * 1.包名所有字母一律小写，并且一般采用自己在互联网上的域名倒序作为自己程序包的唯一前缀，例如：com.chenxin.project
 * 2.类名和接口名每个单词的首字母都要大写，例如：ChenXin
 * 3.常量名所有字母都要大写，单词之间用下划线连接，例如：CHEN_XIN_XUE_XI
 * 4.变量名和方法名的第一个单词首字母小写，从第二个单词开始首字母大写（驼峰命名法），例如：chenXin
 * 5.见名知义
 * <p>
 * 什么是关键字？
 * 关键字是编程语言里事先定义好并赋予特殊含义的单词
 * 所有的关键字都是小写的
 * <p>
 * 什么是保留关键字？
 * const 和 goto是保留关键字，只是说现在暂时没有特殊的用途，但说不定以后某天会突然被赋予意义和被使用到
 */
public class _02Identifier {

}